Q1.

In [7]:
import pandas as pd

series = { 'values' : ['4', '8', '15', '16', '23','42']
}

df= pd.DataFrame(series)
df

  values
0      4
1      8
2     15
3     16
4     23
5     42

Q2

In [6]:
x  = ['14','24','35','4','5','6','7','8','9','10']

df = pd.Series(x)
df

0    14
1    24
2    35
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: object

Q3.

In [16]:
data = {'Name':['Alice','Bob','Claire'],
        'Age': [25,30,27],
        'Gender' : ['Female','Male','Female']
}

dff = pd.DataFrame(data)
dff

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4.

A series displays only data column while DataFrame displays both data column and index also

In [18]:
#Example of Series 

data = {'Name':['Alice','Bob','Claire']}

df2= pd.Series(data)
print("this is the above example of Using Series")
df2

this is the above example of Using Series

Name    [Alice, Bob, Claire]
dtype: object

In [15]:

#Example of DataFrame
data = {'Name':['Alice','Bob','Claire'],
        'Age': [25,30,27],
        'Gender' : ['Female','Male','Female']
}

dff = pd.DataFrame(data)
print("this is the above example of Using DataFrame")
dff

this is the above example of Using DataFrame

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q5:

Some most common used functions: read_csv(), head(), describe(), loc[], values_counts(), groupby(), sortvalues(), fillna()

In [26]:
dff.sort_values(by='Age',inplace= True)
dff

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

Q6:

DataFrame and Panel are mutable

Q7:

In [29]:
Name =pd.Series(['Alice','Bob','Claire'])
Age =  pd.Series([25,30,27])
Gender = pd.Series(['Female','Male','Female'])

dataframe = pd.concat([Name,Age,Gender],axis=1)
dataframe

        0   1       2
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female